
//육효 납갑...
//건괘 : 자인진 오신술
//태괘 : 사묘축 해유미
//이괘 : 묘축해 유미사
//진괘 : 자인진 오신술
//손괘 : 축해유 미사묘
//감괘 : 인진오 신술자
//간괘 : 진오신 술자인
//곤괘 : 미사묘 축해유
//상효...초효
//子丑寅卯 辰巳午未 申酉戌亥
var g_old6_nabgab = {
	6:"戌申午辰寅子", 
	7:"未酉亥丑卯巳", 
	9:"巳未酉亥丑卯", 
	3:"戌申午辰寅子", 
	4:"卯巳未酉亥丑", 
	1:"子戌申午辰寅",
	8:"寅子戌申午辰", 
	2:"酉亥丑卯巳未"
};

////////////////////////////////////////

var g_name81su_dict = {
	'1':'吉/태초격,두령운(太初格,頭領運)/삼양회춘지상(三陽回春之象)', 
	'2':'凶/분산격,재액운(分散格,災厄運)/제사분리지상(諸事分離之象)', 
	'3':'吉/명예격,록록운(名譽格,福祿運)/시생만물지상(始生萬物之象)', 
	'4':'凶/부정격,파괴운(否定格,破壞運)/동서각비지상(東西各飛之象)', 
	'5':'吉/통어격,복수운(通御格,名財運)/성공순리지상(成功順理之象)', 
	'6':'吉/계승격,덕후운(繼承格.德厚運)/풍부순성지상(豊富順成之象)', 
	'7':'吉/강성격,발전운(剛成格,發展運)/강건전진지상(剛健前進之象)', 
	'8':'吉/발달격,전진운(發達格,前進運)/자력발전지상(自力發展之象)', 
	'9':'凶/종국격,시휴운(終局格,時虧運)/대재무용지상(大材無用之象)', 
	'10':'凶/귀공격,공허운(歸空格,空虛運)/만사허무지상(萬事虛無之象)', 
	'11':'吉/갱신격,재흥운(更新格,再興運)/신왕재왕지상(身旺財旺之象)', 
	'12':'凶/유약격,고수운(幼弱格,孤愁運)/박약고독지상(薄弱孤獨之象)', 
	'13':'吉/총명격,지달운(聰明格,智達運)/입신양명지상(立身揚名之象)', 
	'14':'凶/이산격,파괴운(離散格,破壞運)/파난실패지상(波亂失敗之象)', 
	'15':'吉/통솔격,복수운(統率格,福壽運)/만물통합지상(萬物統合之象)', 
	'16':'吉/덕망격,유재운(德望格,裕財運)/온후유덕지상(溫厚有德之象)', 
	'17':'吉/용진격,창달운(勇進格,暢達運)/만사통달지상(萬事通達之象)', 
	'18':'吉/발전격,융창운(發展格,隆昌運)/진취발전지상(進取發展之象)', 
	'19':'凶/성패격,병악운(成敗格,病惡運)/봉학상익지상(鳳鶴傷翼之象)', 
	'20':'凶/공허격,허망운(空虛格,虛妄運)/만사공허지상(萬事空虛之象)', 
	'21':'吉/자립격,두령운(自立格,頭領運)/만인앙시지상(萬人仰視之象)', 
	'22':'凶/중절격,박약운(中折格,薄弱運)/신상위변지상(身上危變之象)', 
	'23':'吉/혁신격,왕성운(革新格,旺盛運)/행복공명지상(幸福功名之象)', 
	'24':'吉/출세격,축재운(出世格,蓄財運)/등천축재지상(登天蓄財之象)', 
	'25':'吉/안강격,재록운(安康格,財綠運)/순풍발전지상(順風發展之象)', 
	'26':'凶/만달격,영웅운(晩達格,英雄運)/평지풍파지상(平地風波之象)', 
	'27':'凶/대인격,중절운(大人格,中折運)/매사좌절지상(每事挫折之象)', 
	'28':'凶/풍파격,파란운(風波格,波瀾運)/일엽편주지상(一葉片舟之象)', 
	'29':'吉/성공격,향복운(成功格,享福運)/신록유실지상(新綠有實之象)', 
	'30':'凶/불측격,불안운(不測格,不安運)/무정세월지상(無情歲月之象)', 
	'31':'吉/세찰격,흥가운(世察格,興家運)/자립영화지상(自立榮華之象)', 
	'32':'吉/순풍격,왕성운(順風格,旺盛運)/의외형복지상(意外亨福之象)', 
	'33':'吉/등용격,융성운(登龍格,隆盛運)/욱일승천지상(旭日昇天之象)', 
	'34':'凶/변란격,파멸운(變亂格,破滅運)/재해풍파지상(災害風波之象)', 
	'35':'吉/태평격,안강운(泰平格,安康運)/만물평화지상(萬物平和之象)', 
	'36':'凶/영웅격,파란운(英雄格,波瀾運)/골육상쟁지상(骨肉相爭之象)', 
	'37':'吉/정치격,출세운(政治格,出世運)/유의유덕지상(有義有德之象)', 
	'38':'吉/문예격,학사운(文藝格,學士運)/학사입신지상(學士入身之象)', 
	'39':'吉/장성격,지휘운(將星格,指揮運)/안락다복지상(安樂多福之象)', 
	'40':'凶/변화격,공허운(變化格,空虛運)/도로무공지상(徒勞無功之象)', 
	'41':'吉/고명격,제중운(高名格,濟衆運)/명진사해지상(名振四海之象)', 
	'42':'凶/신고격,수난운(辛苦格,受難運)/진퇴고고지상(進退苦孤之象)', 
	'43':'凶/성쇠격,산재운(盛衰格,散財運)/육친무덕지상(六親無德之象)', 
	'44':'凶/침마격,파멸운(侵魔格,破滅運)/모사불성지상(謀事不成之象)', 
	'45':'吉/대각격,현달운(大覺格,顯達運)/명월광채지상(明月光彩之象)', 
	'46':'凶/미운격,비수운(未運格,悲愁運)/암행심야지상(暗行深夜之象)', 
	'47':'吉/출세격,득시운(出世格,得時運)/일악천금지상(一握千金之象)', 
	'48':'吉/제중격,영달운(濟衆格,榮達運)/식록유덕지상(食綠有德之象)', 
	'49':'凶/변화격,성패운(變化格,盛敗運)/변화성채지상(變化成敗之象)', 
	'50':'凶/상반격,길흉운(相半格,吉凶運)/미래혼미지상(未來昏迷之象)', 
	'51':'凶/길흉격,성패운(吉凶格,成敗運)/대기만성지상(大器晩成之象)', 
	'52':'吉/승룡격,시승운(昇龍格,時乘運)/전진형통지상(前進亨通之象)', 
	'53':'凶/내허격,반길운(內虛格,半吉運)/불화쟁론지상(不和爭論之象)', 
	'54':'凶/무공격,패가운(無功格,敗家運)/패가망신지상(敗家亡身之象)', 
	'55':'凶/미달격,불안운(未達格,不安運)/만사불성지상(萬事不成之象)', 
	'56':'凶/한탄격,패망운(恨歎格,敗亡運)/부족부진지상(不足不振之象)', 
	'57':'吉/봉시격,강성운(逢時格,强盛運)/성취대기지상(成就大起之象)', 
	'58':'吉/선곤격,후복운(先困格,後福運)/우후향화지상(雨後香花之象)', 
	'59':'凶/재화격,불성운(災禍格,不成運)/매사불우지상(每事不遇之象)', 
	'60':'凶/동요격,재난운(動搖格,災難運)/상하동요지상(上下動搖之象)', 
	'61':'吉/이지격,재리운(理智格,財利運)/개화만발지상(開花萬發之象)', 
	'62':'凶/화락격,쇠퇴운(花落格,衰退運)/일생신고지상(一生辛苦之象)', 
	'63':'吉/순성격,발전운(順成格,發展運)/만사발전지상(萬事發展之象)', 
	'64':'凶/봉상격,쇠멸운(逢霜格,衰滅運)/매사만운지상(每事滿雲之象)', 
	'65':'吉/휘양격,흥가운(輝陽格,興家運)/순풍항해지상(順風港海之象)', 
	'66':'凶/암야격,실등운(暗夜格,失登運)/진퇴양난지상(進退兩難之象)', 
	'67':'吉/천복격,영달운(天福格,榮達運)/승승장구지상(乘勝長驅之象)', 
	'68':'吉/명지격,발명운(明智格,發明運)/명실상부지상(名實相符之象)', 
	'69':'凶/종말격,정지운(終末格,停止運)/고목풍운지상(枯木風雲之象)', 
	'70':'凶/공허격,암야운(空虛格,暗夜運)/몰락멸지지상(沒落滅之之象)', 
	'71':'吉/현룡격,발전운(見龍格,發展運)/선고후감지상(先苦後甘之象)', 
	'72':'凶/상반격,후곤운(相半格,後困運)/길흉상반지상(吉凶相半之象)', 
	'73':'吉/평길격,안과운(平吉格,安過運)/행복길상지상(幸福吉祥之象)', 
	'74':'凶/우매격,불우운(愚昧格,不遇運)/서중화현지상(書中火炫之象)', 
	'75':'吉/적시격,평화운(適時格,平和運)/개문복래지상(開門福來之象)', 
	'76':'凶/선곤격,후성운(先困格,後盛運)/선흉후길지상(先凶後吉之象)', 
	'77':'凶/전후격,길흉운(前後格,吉凶運)/춘성회춘지상(春城回春之象)', 
	'78':'凶/선길격,평복운(先吉格,平福運)/공성후퇴지상(功成後退之象)', 
	'79':'凶/종국격,종말운(終局格,終末運)/궁극불신지상(窮極不伸之象)', 
	'80':'凶/종극격,은둔운(종極격,은둔운)/구사일생지상(九死一生之象)', 
	'81':'吉/환원격,성대운(還元格,盛大運)/청룡등룡지상(靑龍登龍之象)'
};


//한글의 자모로 조합 가능한 글자의 수는 11,172개
/**
[초성/자음] - 19자
{'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'}

[중성/모음] - 21자

{'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ',
'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'}

[종성/받침] - 28자 (채움문자 포함)

{' ', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ',
'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'}

[초성 유니코드]
{0x3131, 0x3132, 0x3134, 0x3137, 0x3138, 0x3139, 0x3141, 0x3142, 0x3143, 0x3145, 0x3146, 0x3147, 
0x3148, 0x3149, 0x314a, 0x314b, 0x314c, 0x314d, 0x314e}

[중성 유니코드]
{0x314f, 0x3150, 0x3151, 0x3152, 0x3153, 0x3154, 0x3155, 0x3156, 0x3157, 0x3158, 0x3159, 0x315a,
0x315b, 0x315c, 0x315d, 0x315e, 0x315f, 0x3160, 0x3161, 0x3162, 0x3163}

[종성 유니코드]
{0x0000, 0x3131, 0x3132, 0x3133, 0x3134, 0x3135, 0x3136, 0x3137, 0x3139, 0x313a, 0x313b, 0x313c, 
0x313d, 0x313e, 0x313f, 0x3140, 0x3141, 0x3142, 0x3144, 0x3145, 0x3146, 0x3147, 0x3148, 0x314a, 
0x314b, 0x314c, 0x314d, 0x314e}


[분리 기본 공식]
	초성 = ( ( (글자 - 0xAC00) - (글자 - 0xAC00) % 28 ) ) / 28 ) / 21
	중성 = ( ( (글자 - 0xAC00) - (글자 - 0xAC00) % 28 ) ) / 28 ) % 21
	종성 = (글자 - 0xAC00) % 28

[합치기 기본 공식]
	원문 = 0xAC00 + 28 * 21 * (초성의 index) + 28 * (중성의 index) + (종성의 index)

각 index 정보는 CHOSUNG, JUNGSUNG, JONGSUNG char[]에 정의한 index 입니다.
하지만 아래 코드에서는 원문이 필요 없기 때문에 합치기 위한 로직은 포함 되어 있지 않습니다
*/

var g_chosung = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];
var g_jungsung = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'];
var g_jongsung = ['', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];


//육효 궁...
//세응 :   6,3    1,4     2,5     3,6     4,1    5,2    4,1     3,6 
//1~6까지의 시작 숫자에 3을 더하여 6으로 나누면 뒤의 숫자가 나온다.
//건금궁 : 중천건, 천풍구, 천산돈, 천지비, 풍지관, 산지박, 화지진, 화천대유
//태금궁 : 태위택, 택수곤, 택지췌, 택산함, 수산건, 지산겸, 뢰산소과, 뢰택귀매
//이화궁 : 이위화, 화산려, 화풍정, 화수미제, 산수몽, 풍수환, 천수송, 천화동인
//진목궁 : 진위뢰, 뢰지예, 뢰수해, 뢰풍항, 지풍승, 수풍정, 택풍대과, 택뢰수
//손목궁 : 손위풍, 풍천소축, 풍화가인, 풍뢰익, 천뢰무망, 화뢰서합, 산뢰이, 산풍고
//감수궁 : 감위수, 수택절, 수뢰둔, 수화기제, 택화혁, 뢰화풍, 지화명이, 지수사
//간토궁 : 간위산, 산화비, 산천대축, 산택손, 화택규, 천택리, 풍택중부, 풍산점
//곤토궁 : 곤위지, 지뢰복, 지택림, 지천태, 뢰천대장, 택천쾌, 수천수, 수지비
//"궁/(대성괘(시작숫자))/(대성괘(시작숫자))...
var g_old6_gung_list = [
	"乾金宮/6.6(6)/6.4(1)/6.8(2)/6.2(3)/4.2(4)/8.2(5)/9.2(4)/9.6(3)",
	"兌金宮/7.7(6)/7.1(1)/7.2(2)/7.8(3)/1.8(4)/2.8(5)/3.8(4)/3.7(3)", 
	"離火宮/9.9(6)/9.8(1)/9.4(2)/9.1(3)/8.1(4)/4.1(5)/6.1(4)/6.9(3)", 
	"震木宮/3.3(6)/3.2(1)/3.1(2)/3.4(3)/2.4(4)/1.4(5)/7.4(4)/7.3(3)", 
	"巽木宮/4.4(6)/4.6(1)/4.9(2)/4.3(3)/6.3(4)/9.3(5)/8.3(4)/8.4(3)", 
	"坎水宮/1.1(6)/1.7(1)/1.3(2)/1.9(3)/7.9(4)/3.9(5)/2.9(4)/2.1(3)", 
	"艮土宮/8.8(6)/8.9(1)/8.6(2)/8.7(3)/9.7(4)/6.7(5)/4.7(4)/4.8(3)", 
	"坤土宮/2.2(6)/2.3(1)/2.7(2)/2.6(3)/3.6(4)/7.6(5)/1.6(4)/1.2(3)"
];


//육효 납갑 NEW...
//건괘 : 자묘진 오유술
//태괘 : 사인축 해신미
//이괘 : 인축해 신미사
//진괘 : 자묘진 오유술
//손괘 : 축해신 미사인
//감괘 : 묘진오 유술자
//간괘 : 진오유 술자묘
//곤괘 : 미사인 축해신
//子丑寅卯 辰巳午未 申酉戌亥
//오른쪽에서 왼쪽으로 작성...
var g_new6_nabgab = {
	6:"戌酉午辰卯子", 
	7:"未申亥丑寅巳", 
	9:"巳未申亥丑寅", 
	3:"戌酉午辰卯子", 
	4:"寅巳未申亥丑", 
	1:"子戌酉午辰卯",
	8:"卯子戌酉午辰", 
	2:"申亥丑寅巳未"
};


//육효 궁 NEW...
//세응 :   1,4     6,3    5,2    4,1    3,6     2,5    3,1     4,1
//건금궁 : 건위천, 택천쾌, 뇌천대장, 지천태, 지택림, 지뢰복, 지화명이, 지수사,
//태금궁 : 태위택, 천택리, 화택규, 산택손, 산천대축, 산화비, 산뢰이, 산풍고,
//이화궁 : 이위화, 뇌화풍, 택화혁, 수화기제, 수뢰둔, 수택절, 수천수, 수지비,  
//진목궁 : 진위뢰, 화뢰서합, 천뢰무망, 풍뢰익, 풍화가인, 풍천소축, 풍택중부, 풍산점, 
//손목궁 : 손위풍, 수풍정, 지풍승, 뇌풍항, 뇌수해, 뇌지예, 뇌산소과, 뇌택귀매, 
//감수궁 : 감위수, 풍수환, 산수몽, 화수미제, 화풍정, 화산려, 화지진, 화천대유, 
//간토궁 : 간위산, 지산겸, 수산건, 택산함, 택지췌, 택수곤, 택풍대과, 택뢰수, 
//곤토궁 : 곤위지, 산지박, 풍지관, 천지비, 천산둔, 천풍구, 천수송, 천화동인,
var g_new6_gung_list = [
	"乾金宮/6.6(1)/7.6(6)/3.6(5)/2.6(4)/2.7(3)/2.3(2)/2.9(3)/2.1(4)",
	"兌金宮/7.7(1)/6.7(6)/9.7(5)/8.7(4)/8.6(3)/8.9(2)/8.3(3)/8.4(4)", 
	"離火宮/9.9(1)/3.9(6)/7.9(5)/1.9(4)/1.3(3)/1.7(2)/1.6(3)/1.2(4)", 
	"震木宮/3.3(1)/9.3(6)/6.3(5)/4.3(4)/4.9(3)/4.6(2)/4.7(3)/4.8(4)", 
	"巽木宮/4.4(1)/1.4(6)/2.4(5)/3.4(4)/3.1(3)/3.2(2)/3.8(3)/3.7(4)", 
	"坎水宮/1.1(1)/4.1(6)/8.1(5)/9.1(4)/9.4(3)/9.8(2)/9.2(3)/9.6(4)", 
	"艮土宮/8.8(1)/2.8(6)/1.8(5)/7.8(4)/7.2(3)/7.1(2)/7.4(3)/7.3(4)", 
	"坤土宮/2.2(1)/8.2(6)/4.2(5)/6.2(4)/6.8(3)/6.4(2)/6.1(3)/6.9(4)"
];


var g_6hyo_10skygan = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];

//子丑寅卯 辰巳午未 申酉戌亥
var g_6hyo_12jiji = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];

//지장간
//12지지안에 저장된 지장간(地藏干)
var g_gi_jang_gan = {"子":"(壬)癸", "丑":"癸辛己", "寅":"戊丙甲", "卯":"(甲)乙", "辰":"乙癸戊", "巳":"戊庚丙", "午":"(丙)己丁", "未":"丁乙己", "申":"戊壬庚", "酉":"(庚)辛", "戌":"辛丁戊", "亥":"甲壬"};


var g_old6hyo_12jiji_5haeng = {
	"子":"水", "丑":"土", "寅":"木", "卯":"木", "辰":"土", "巳":"火", "午":"火", "未":"土", "申":"金", "酉":"金", "戌":"土", "亥":"水"};


//상화 [미술]을 [토]로 보지 않고 [화]로 본다.
var g_new6hyo_12jiji_5haeng = {
	"子":"水", "丑":"土", "寅":"木", "卯":"木", "辰":"土", "巳":"火", "午":"火", "未":"火", "申":"金", "酉":"金", "戌":"火", "亥":"水"};


//사주 12운성...
//[토]는 [화]와 같은 (장)생지
var g_4ju_12unseong_saengji = {
	"寅":"亥", "卯":"亥", 
	"巳":"寅", "午":"寅", 
	"申":"巳", "酉":"巳",
	"亥":"申", "子":"申",
	"丑":"寅", "辰":"寅",  
	"未":"寅", "戌":"寅"
};

//육효 12운성...
//절태양장(생) 목관건제 쇄병사묘
//12지지 관련 12운성의 (장)생지 위치
//[토]는 [수]와 같은 (장)생지
var g_old6hyo_12unseong_saengji = {
	"寅":"亥", "卯":"亥", 
	"巳":"寅", "午":"寅", 
	"申":"巳", "酉":"巳",
	"亥":"申", "子":"申",
	"丑":"申", "辰":"申",
	"未":"申", "戌":"申"
};

//new 육효 12운성...
//6효에서 [토:축진]은 [수]와 같은 (장)생지
//[미술]은 상화이므로 [미술]은 [화]와 같은 (장)생지
var g_new6hyo_12unseong_saengji = {
	"寅":"亥", "卯":"亥", 
	"巳":"寅", "午":"寅", 
	"申":"巳", "酉":"巳",
	"亥":"申", "子":"申",
	"辰":"申", "丑":"申",  
	"未":"寅", "戌":"寅"
};



//절, 태, 양, 장생, 목욕, 관대, 건록, 제왕, 쇠, 병, 사, 묘
var g_6hyo_12unseong = ["절", "태", "양", "생", "욕", "대", "록", "왕", "쇠", "병", "사", "묘"];

//육효-육친: 孫父財官兄
var g_6hyo_10sin_list = ["兄", "孫", "財", "官", "父"];

//육효-육수: 靑朱句蛇白玄
//하괘 초효부터 일주 판별하여 적용함
//靑(청룡: 룡), 朱(주작: 참새), 句(구진: 거북), 蛇(등사: 뱀), 白(백호: 호랑이), 玄(현무: 박쥐)
//갑을일 : 청부터 순번대로
//병정일 : 주부터
//무토일 : 구부터
//기토일 : 사부터
//경신일 : 백부터
//임계일 : 현부터
var g_6hyo_6su_list = ["靑", "朱", "句", "蛇", "白", "玄"];


//주역 단사 데이타
var g_juyeok_dansa = {

	'1.1':'1.1단사',
	'1.2':'1.2단사',
	'1.3':'1.3단사',
	'1.4':'1.4단사',
	'1.5':'1.5단사',
	'1.6':'1.6단사',
	'1.7':'1.7단사',
	'1.8':'1.8단사',
	'1.9':'1.9단사',
	'2.1':'2.1단사',
	'2.2':'2.2단사',
	'2.3':'2.3단사',
	'2.4':'2.4단사',
	'2.5':'2.5단사',
	'2.6':'2.6단사',
	'2.7':'2.7단사',
	'2.8':'2.8단사',
	'2.9':'2.9단사',
	'3.1':'3.1단사',
	'3.2':'3.2단사',
	'3.3':'3.3단사',
	'3.4':'3.4단사',
	'3.5':'3.5단사',
	'3.6':'3.6단사',
	'3.7':'3.7단사',
	'3.8':'3.8단사',
	'3.9':'3.9단사',
	'4.1':'4.1단사',
	'4.2':'4.2단사',
	'4.3':'4.3단사',
	'4.4':'4.4단사',
	'4.5':'4.5단사',
	'4.6':'4.6단사',
	'4.7':'4.7단사',
	'4.8':'4.8단사',
	'4.9':'4.9단사',
	'5.1':'5.1단사',
	'5.2':'5.2단사',
	'5.3':'5.3단사',
	'5.4':'5.4단사',
	'5.5':'5.5단사',
	'5.6':'5.6단사',
	'5.7':'5.7단사',
	'5.8':'5.8단사',
	'5.9':'5.9단사',
	'6.1':'6.1단사',
	'6.2':'6.2단사',
	'6.3':'6.3단사',
	'6.4':'6.4단사',
	'6.5':'6.5단사',
	'6.6':'6.6단사',
	'6.7':'6.7단사',
	'6.8':'6.8단사',
	'6.9':'6.9단사',
	'7.1':'7.1단사',
	'7.2':'7.2단사',
	'7.3':'7.3단사',
	'7.4':'7.4단사',
	'7.5':'7.5단사',
	'7.6':'7.6단사',
	'7.7':'7.7단사',
	'7.8':'7.8단사',
	'7.9':'7.9단사',
	'8.1':'8.1단사',
	'8.2':'8.2단사',
	'8.3':'8.3단사',
	'8.4':'8.4단사',
	'8.5':'8.5단사',
	'8.6':'8.6단사',
	'8.7':'8.7단사',
	'8.8':'8.8단사',
	'8.9':'8.9단사',
	'9.1':'9.1단사',
	'9.2':'9.2단사',
	'9.3':'9.3단사',
	'9.4':'9.4단사',
	'9.5':'9.5단사',
	'9.6':'9.6단사',
	'9.7':'9.7단사',
	'9.8':'9.8단사',
	'9.9':'9.9단사'
};

//a_dansa_key: "3.2" 혹은 "3.2.1"
function get_juyeok_64_dansa(a_dansa_key) {
	var my_key = a_dansa_key.substr(0, 3);

	var my_val = g_juyeok_dansa[my_key];
	

	return my_val;
}



//주역 효사 데이타
var g_juyeok_hyosa = {
    '1.1.1':'初六/習坎 入于坎窞 凶/습감 입우감담 흉/',
    '1.1.2':'九二/坎 有險 求 小得/감 유험 구 소득/',
    '1.1.3':'六三/來之 坎坎 險 且枕 入于坎窞 勿用/래지 감감 험 차침 입우감담 물용/',
    '1.1.4':'六四/樽酒 簋貳 用缶 納約自牖 終无咎/준주 궤이 용부 납약자유 종무구/',
    '1.1.5':'九五/坎不盈 祗旣平 无咎/감불영 지기평 무구/',
    '1.1.6':'上六/係用徽纆 寘于叢棘 三歲 不得 凶/계용휘묵 치우총극 삼세 부득 흉/',
    '1.2.1':'初六/有孚比之 无咎 有孚 盈缶 終 來有他吉/유부비지 무구 유부 여부 종 래유타길/',
    '1.2.2':'六二/比之自內 貞 吉/비지자내 정 길/',
    '1.2.3':'六三/比之匪人/비지비인/',
    '1.2.4':'六四/外比之 貞 吉/외비지 정 길/',
    '1.2.5':'九五/顯比 王用三驅 失前禽 邑人不誡 吉/현비 왕용삼구 실전금 읍인불계 길/',
    '1.2.6':'上六/比之无首 凶/비지무수 흉/',
    '1.3.1':'初九/磐桓 利居貞 利建侯/반환 이거정 이건후/',
    '1.3.2':'六二/屯如邅如 乘馬班如 匪寇 婚媾  女子 貞 不字 十年 乃字/둔여전여 승마반여 비구 혼구 여자 정 부자 십년 내자/',
    '1.3.3':'六三/卽鹿无虞 惟入于林中  君子 幾 不如舍 往 吝/즉록무우 유입우임중 군자 기 불여사 왕 인/',
    '1.3.4':'六四/乘馬班如 救婚媾 往 吉 无不利/승마반여 구흔구 왕 길 무불리/',
    '1.3.5':'九五/屯其膏 小貞 吉 大貞 凶/둔기고 소정 길 대정 흉/',
    '1.3.6':'上六/乘馬班如 泣血漣如/승마반여 읍혈연여/',
	'1.4.1':'初六/井泥不食 舊井 无禽/정니불식 구정 무금/',
	'1.4.2':'九二/井谷. 射鮒 甕敝漏/정곡. 사부 옹폐루/',
	'1.4.3':'九三/井渫不食 爲我心惻 可用汲  王明 竝受其福/정설불식 위아심측 가용급  왕명 병수기복/',
	'1.4.4':'六四/井甃 无咎/정추 무구/',
	'1.4.5':'九五/井冽寒泉食/정렬한천식/',
	'1.4.6':'上六/井收勿幕 有孚. 元吉/정수물막 유부. 원길/',
	'1.5.1':'단사','1.5.2':'단사','1.5.3':'단사','1.5.4':'단사','1.5.5':'단사','1.5.6':'단사',
    '1.6.1':'初九/需于郊 利用恒 无咎/수유교 이용항 무구/',
    '1.6.2':'九二/需于沙 小有言 終吉/수우사 소유언 종길/',
    '1.6.3':'九三/需于泥 致寇至/수우니 치구지/',
    '1.6.4':'六四/需于血 出自穴/수우혈 출자혈/',
    '1.6.5':'九五/需于酒食 貞 吉/수우주식 정 길/',
    '1.6.6':'上六/入于穴 有不速之客三人 來 敬之(면) 終吉/입우혈 유불속지객삼인 래 경지(면) 종길/',
	'1.7.1':'初九/不出戶庭 无咎/불출호정 무구/',
	'1.7.2':'九二/不出門庭 凶/불출문정 흉/',
	'1.7.3':'六三/不節若 則嗟若 无咎/부절약 즉차약 무구/',
	'1.7.4':'六四/安節 亨/안절 형/',
	'1.7.5':'九五/甘節. 吉 往 有尙/감절. 길 왕 유상/',
	'1.7.6':'上六/苦節 貞 凶 悔 亡/고절 정 흉 회 망/',
	'1.8.1':'初六/往 蹇 來 譽/왕 건 래 예/',
	'1.8.2':'六二/王臣蹇蹇 匪躬之故/왕신건건 비궁지고/',
	'1.8.3':'九三/往 蹇 來 反/왕 건 래 반/',
	'1.8.4':'六四/往 蹇 來 連/완 건 래 연/',
	'1.8.5':'九五/大蹇 朋來/대건 붕래/',
	'1.8.6':'上六/往 蹇 來 碩 吉 利見大人/왕 건 래 석 길 이견대인/',
	'1.9.1':'初九/曳其輪 濡其尾 无咎/예기륜 유기미 무구/',
	'1.9.2':'六二/婦喪其茀 勿逐 七日 得/부상기불 물축 칠일 득/',
	'1.9.3':'九三/高宗 伐鬼方 三年克之 小人勿用/고종 벌귀방 삼년극지 소인물용/',
	'1.9.4':'六四/濡 有衣袽 終日戒/유 유의여 종일계/',
	'1.9.5':'九五/東隣殺牛 不如西隣之禴祭 實受其福/동린살우 불여서린지약제 실수기복/',
	'1.9.6':'上六/濡其首 厲/유기수 려/',
    '2.1.1':'初六/師出以律 否 藏 凶/사출이율 부 장 흉/',
    '2.1.2':'九二/在師 中 吉 无咎 王三錫命/재사 중 길 무구 왕삼석명/',
    '2.1.3':'六三/師或輿尸 凶/사혹여시 흉/',
    '2.1.4':'六四/師左次 无咎/사좌차 무구/',
    '2.1.5':'六五/田有禽 利執言 无咎. 長子 帥師 弟子 輿尸 貞 凶/전유금 이집언 무구. 장자 솔사 제자 여시 정 흉/',
    '2.1.6':'上六/大君 有命 開國承家 小人勿用/대군 유명 개국승가 소인물용/',
	'2.2.1':'初六/履霜 堅氷 至/이상 견빙 지/',
    '2.2.2':'六二/直方大 不習 无不利/직방대 불습 무불리/',
    '2.2.3':'六三/含章可貞 或從王事 无成有終/함장가정 흑종왕사 무성유종/',
    '2.2.4':'六四/括囊 无咎 无譽/괄낭 무구 무예/',
    '2.2.5':'六五/黃裳 元吉/황상 원길/',
    '2.2.6':'上六/龍戰于野 其血 玄黃/용전우야 기혈 현황/',
	'2.3.1':'初九/不遠復 无祗悔 元吉/불원복 무지회 원길/',
	'2.3.2':'六二/休復 吉/휴복 길/',
	'2.3.3':'六三/頻復 厲 无咎/빈복 려 무구/',
	'2.3.4':'六四/中行 獨復/중행 독복/',
	'2.3.5':'六五/敦復 无悔/돈복 무회/',
	'2.3.6':'上六/迷復 凶 有災眚 用行師 終有大敗 以其國 君 凶 至于十年 不克征/미복 흉 유재생 용행사 종유대패 이기국 군 흉 지우십년 불극정/',
	'2.4.1':'初六/允升 大吉/윤승 대길/',
	'2.4.2':'九二/孚乃利用禴 无咎/부내이용약 무구/',
	'2.4.3':'九三/升虛邑/승허읍/',
	'2.4.4':'六四/王用享于岐山 吉 无咎/왕용향우기산 길 무구/',
	'2.4.5':'六五/貞 吉 升階/정 길 승계/',
	'2.4.6':'上六/冥升 利于不息之貞/명승 이우불식지정/',
	'2.5.1':'단사','2.5.2':'단사','2.5.3':'단사','2.5.4':'단사','2.5.5':'단사','2.5.6':'단사',
    '2.6.1':'初九/拔茅茹. 以其彙 征 吉/발모여. 이기휘 정 길/',
    '2.6.2':'九二/包荒 用馮河 不遐遺  朋亡 得尙于中行/포황 용빙하 불하유 붕망 득상우중행/',
    '2.6.3':'九三/无平不陂 无往不復 艱貞 无咎  勿恤 其孚 于食 有福/무평불피 무왕불복 간정 무구  물휼 기부 우식 유복/',
    '2.6.4':'六四/翩翩 不富以其隣 不戒以孚/편편 불부이기린 불계이부/',
    '2.6.5':'六五/帝乙歸昧 以祉 元吉/제을귀매 이지 원길/',
    '2.6.6':'上六/城復于隍.  勿用師 自邑告命 貞 吝/성복우황.  물용사 자읍고명 정 인/',
	'2.7.1':'初九/咸臨 貞 吉/함림 정 길/',
	'2.7.2':'九二/咸臨 吉 无不利/함림 길 무불리/',
	'2.7.3':'六三/甘臨 无有利 旣憂之 无咎/감림 무유리 기우지 무구/',
	'2.7.4':'六四/至臨 无咎/지림 무구/',
	'2.7.5':'六五/知臨 大君之宜 吉/지림 대군지의 길/',
	'2.7.6':'上六/敦臨 吉 无咎/돈림 길 무구/',
	'2.8.1':'初六/謙謙君子 用涉大川 吉/겸겸군자 용섭대천 길/',
	'2.8.2':'六二/鳴謙 貞 吉/명경 정 길/',
	'2.8.3':'九三/勞謙 君子 有終 吉/노겸 군자 유종 길/',
	'2.8.4':'六四/无不利撝謙/무불리휘겸/',
	'2.8.5':'六五/不富以其隣 利用侵伐 无不利/불부이기린 이용침벌 무불리/',
	'2.8.6':'上六/鳴謙 利用行師 征邑國/명겸 이용행사 정읍국/',
	'2.9.1':'初九/明夷于飛 垂其翼   君子于行 三日不食 有攸往 主人 有言/명이우비 수기익   군자우행 삼일불식 유유왕 주인 유언/',
	'2.9.2':'六二/明夷 夷于左股 用拯馬 壯 吉/명이 이우좌고 용증마 장 길/',
	'2.9.3':'九三/明夷于南狩 得其大首 不可疾貞/명이우남수 득기대수 불가질정/',
	'2.9.4':'六四/入于左腹 獲明夷之心 于出門庭/입우좌복 획명이지심 우출문정/',
	'2.9.5':'六五/箕子之明夷 利貞/기자지명이 이정/',
	'2.9.6':'上六/不明 晦 初登于天 後入于地/불명 회 초등우천 후입우지/',
	'3.1.1':'初六/无咎/무구/',
	'3.1.2':'九二/田獲三狐 得黃矢 貞 吉/전획삼호 득황시 정 길/',
	'3.1.3':'六三/負且乘. 致寇至 貞 吝/부차승. 치구지 정 인/',
	'3.1.4':'九四/解而拇 朋至 斯孚/해이무 붕지 사부/',
	'3.1.5':'六五/君子 維有解 吉 有孚于小人/군자 유유해 길 유부우소인/',
	'3.1.6':'上六/公用射準于高墉之上 獲之 无不利/공용사준우고용지상 획지 무불리/',
	'3.2.1':'初六/鳴豫 凶/명예 흉/',
	'3.2.2':'六二/介于石 不終日 貞 吉/개우석 부종일 정 길/',
	'3.2.3':'六三/盱豫. 悔 遲 有悔/우예. 회 지 유회/',
	'3.2.4':'九四/由豫. 大有得 勿疑 朋 盍簪/유예. 대유득 물의 붕 합잠/',
	'3.2.5':'六五/貞 疾 恒不死/정 질 항불사/',
	'3.2.6':'上六/冥豫 成 有渝 无咎/명예 성 유유 무구/',
	'3.3.1':'初九/震來虩虩 後 笑言啞啞 吉/진래혁혁 후 소언아아 길/',
	'3.3.2':'六二/震來厲. 億喪貝 躋于九陵 勿逐 七日得/진래려. 억상패 제우구릉 물축 칠일득/',
	'3.3.3':'六三/震蘇蘇 震行 无眚/진소소 진행 무생/',
	'3.3.4':'九四/震 遂泥/진 수니/',
	'3.3.5':'六五/震 往來 厲 億 无喪有事/진 왕래 려 억 무상유사/',
	'3.3.6':'上六/震 索索 視 矍矍 征 凶 震不于其躬 于其隣 无咎 婚媾 有言/진 삭삭 시 확확 정 흉 진불우기궁 우기린 무구 혼구 유언/',
	'3.4.1':'初六/浚恒 貞 凶 无攸利/준항 정 흉 무유리/',
	'3.4.2':'九二/悔亡/회망/',
	'3.4.3':'九三/不恒其德. 或承之羞 貞 吝/불항기덕. 혹승지수 정 인/',
	'3.4.4':'九四/田无禽/전무금/',
	'3.4.5':'六五/恒其德 貞 婦人 吉 夫子 凶/항기덕 정 부인 길 부자 흉/',
	'3.4.6':'上六/振恒 凶/진항 흉/',
	'3.5.1':'단사','3.5.2':'단사','3.5.3':'단사','3.5.4':'단사','3.5.5':'단사','3.5.6':'단사',
	'3.6.1':'初九/壯于趾 征 凶 有孚/장우지 정 흉 유부/',
	'3.6.2':'九二/貞 吉/정 길/',
	'3.6.3':'九三/小人 用壯 君子 用罔 貞 厲  羝羊 觸藩 羸其角/소인 용장 군자 용망 정 려  저양 촉번 리기각/',
	'3.6.4':'九四/貞 吉 悔 亡  藩決不羸 壯于大輿之輹/정 길 회 망  번결불리 장우대여지복/',
	'3.6.5':'六五/喪羊于易 无悔/상양우이 무회/',
	'3.6.6':'上六/羝羊 觸藩 不能退 不能遂  无攸利 艱則吉/저양 촉번 불능퇴 불능수  무유리 간즉길/',
	'3.7.1':'初九/歸妹以娣 跛能履. 征 吉/귀매이제 파능리. 정 길/',
	'3.7.2':'九二/眇能視 利幽人之貞/묘능시 이유인지정/',
	'3.7.3':'六三/歸妹以須 反歸以娣/귀매이수 반귀이제/',
	'3.7.4':'九四/歸妹愆期 遲歸 有時/귀매건기 지귀 유시/',
	'3.7.5':'六五/帝乙歸妹 其君之袂 不如其娣之袂 良  月其望 吉/제을귀매 기군지몌 불여기제지몌 양  월기망 길/',
	'3.7.6':'上六/女 承筐无實. 士 刲羊无血 无攸利/여 승광무실. 사 규양무혈 무유리/',
	'3.8.1':'初六/飛鳥 以凶/비조 이흉/',
	'3.8.2':'六二/過其祖 遇其妣 不及其君  遇其臣 无咎/과기조 우기비 불급기군  우기신 무구/',
	'3.8.3':'九三/弗過防之 終或戕之 凶/불과방지 종혹장지 흉/',
	'3.8.4':'九四/无咎 弗過 遇之 往 厲  必戒 勿用永貞/무구 불과 우지 왕 려  필계 물용영정/',
	'3.8.5':'六五/密雲不雨 自我西郊 公 弋取彼在穴/밀운불우 자아서교 공 익취피재혈/',
	'3.8.6':'上六/弗遇 過之 飛鳥 離之 凶 是謂災眚/불우 과지 비조 흉 시위재생/',
	'3.9.1':'初九/遇其配主 雖旬 无咎 往 有尙/우기배주 수순 무구 왕 유상/',
	'3.9.2':'六二/豊其篰. 日中見斗 往 得疑疾 有孚發若 吉/풍기부. 일중견두 왕 득의질 유부발약 길/',
	'3.9.3':'九三/豊其沛. 日中見沬 折其右肱 无咎/풍기패. 일중견매 절기우굉 무구/',
	'3.9.4':'九四/豊其蔀. 日中見斗 遇其夷主 吉/풍기부. 일중견두 우기이주 길/',
	'3.9.5':'六五/來章 有慶譽 吉/래장 유경예 길/',
	'3.9.6':'上六/豊其屋 蔀其家. 闚其戶 闃其无人 三歲 不覿 凶/풍기옥 부기가. 규기호 격기무인 삼세 부적 흉/',
	'4.1.1':'初六/用拯 馬 壯 吉/용증 마 장 길/',
	'4.1.2':'九二/渙 奔其机 悔 亡/환 분기궤 회 망/',
	'4.1.3':'六三/渙 其躬 无悔/환 기궁 무회/',
	'4.1.4':'六四/渙 其群. 元吉 渙 有丘 匪夷所思/환 기군. 원길 환 유구 비이소사/',
	'4.1.5':'九五/渙 汗其大號 渙 王居 无咎/환 한기대호 환 왕거 무구/',
	'4.1.6':'上九/渙 其血 去 惕 出 无咎/환 기혈 거 척 출 무구/',
	'4.2.1':'初六/童觀 小人 无咎 君子 吝/동관 소인 무구 군자 인/',
	'4.2.2':'六二/闚觀 利女貞/규관 이여정/',
	'4.2.3':'六三/觀我生 進退/관아생 진퇴/',
	'4.2.4':'六四/觀國之光 利用賓于王/관국지광 이용빈우왕/',
	'4.2.5':'九五/觀我生 君子 无咎/관아생 군자 무구/',
	'4.2.6':'上九/觀其生 君子 无咎/관기생 군자 무구/',
	'4.3.1':'初九/利用爲大作 元吉 无咎/이용위대작 원길 무구/',
	'4.3.2':'六二/或益之 十朋之. 龜 弗克違 永貞 吉 王用享于帝 吉/혹익지 십붕지. 귀 불극위 영정 길 왕용향우제 길/',
	'4.3.3':'六三/益之用凶事 无咎 有孚中行 告公用圭/익지용흉사 무구 유부중행 고공용규/',
	'4.3.4':'六四/中行 告公從 利用爲依 遷國/중행 고공종 이용위의 천국/',
	'4.3.5':'九五/有孚惠心. 勿問 元吉 有孚 惠我德/유부혜심. 물문 원길 유부 혜아덕/',
	'4.3.6':'上九/莫益之. 或擊之 立心勿恒 凶/막익지. 혹격지 입심물항 흉/',
	'4.4.1':'初六/進退 利武人之貞/진퇴 이무인지정/',
	'4.4.2':'九二/巽在牀下 用史巫紛若 吉 无咎/손재상하 용사무분약 길 무구/',
	'4.4.3':'九三/頻巽 吝/빈손 인/',
	'4.4.4':'六四/悔 亡 田獲三品/회 망 전획삼품/',
	'4.4.5':'九五/貞 吉 悔 亡 无不利 无初有終. 先庚三日 後庚三日 吉/정 길 회 망 무불리 무초유종. 선경삼일 후경삼일 길/',
	'4.4.6':'上九/巽在牀下 喪其資斧 貞 凶/손재상하 상기자부 정 흉/',
	'4.5.1':'단사','4.5.2':'단사','4.5.3':'단사','4.5.4':'단사','4.5.5':'단사','4.5.6':'단사',
    '4.6.1':'初九/復 自道 何其咎 吉/복 자도 하기구 길/',
    '4.6.2':'九二/牽復 吉/견복 길/',
    '4.6.3':'九三/輿說輻 夫妻反目/여탈복 부처반목/',
    '4.6.4':'六四/有孚 血去 惕出 无咎/유부 혈거 척출 무구/',
    '4.6.5':'九五/有孚 攣如 富以其隣/유부 연여 부이기린/',
    '4.6.6':'上九/旣雨旣處 尙德 載 婦 貞 厲.  月幾望 君子 征 凶/기우기처 상덕 재 부 정 려.  월기망 군자 정 흉/',
	'4.7.1':'初九/虞 吉 有他 不燕/우 길 유타 불연/',
	'4.7.2':'九二/鳴鶴 在陰 其子 和之. 我有好爵 吾與爾靡之/명학 재음 기자 화지. 아유호작 오여이미지/',
	'4.7.3':'六三/得敵 或鼓或罷或泣或歌/득적 혹고혹파혹읍혹가/',
	'4.7.4':'六四/月幾望 馬匹 亡 无咎/월기망 마필 망 무구/',
	'4.7.5':'九五/有孚 攣如 无咎/유부 연여 무구/',
	'4.7.6':'上九/翰音 登于天 貞 凶/한음 등우천 정 흉/',
	'4.8.1':'初六/鴻漸于干 小子 厲 有言 无咎/홍점우간 소자 려 유언 무구/',
	'4.8.2':'六二/鴻漸于磐. 飮食 衎衎 吉/홍점우반. 음식 간간 길/',
	'4.8.3':'九三/鴻漸于陸 夫征 不復 婦孕 不育 凶 利禦寇/홍점우륙 부정 불복 부잉 불육 흉 이어구/',
	'4.8.4':'六四/鴻漸于木 或得其桷 无咎/홍점우목 혹득기각 무구/',
	'4.8.5':'九五/鴻漸于陵 婦 三歲 不孕 終莫之勝. 吉/홍점우릉 부 삼세 불잉 종막지승. 길/',
	'4.8.6':'上九/鴻漸于逵 其羽 可用爲儀 吉/홍점우규 기우 가용위의 길/',
	'4.9.1':'初九/閑有家 悔 亡/한유가 회 망/',
	'4.9.2':'六二/无攸遂 在中饋(면) 貞吉/무유수 재중궤(면) 정길/',
	'4.9.3':'九三/家人 嗃嗃 悔厲 吉    婦子 嘻嘻(면) 終吝/가인 학학 회려 길    부자 희희(면) 종린',
	'4.9.4':'六四/富家 大吉/부가 대길/',
	'4.9.5':'九五/王假有家 勿恤 吉/왕가유가 물휼 길/',
	'4.9.6':'上九/有孚 威如 終吉/유부 위여 종길/',
	'5.1.1':'단사','5.1.2':'단사','5.1.3':'단사','5.1.4':'단사','5.1.5':'단사','5.1.6':'단사',
	'5.2.1':'단사','5.2.2':'단사','5.2.3':'단사','5.2.4':'단사','5.2.5':'단사','5.2.6':'단사',
	'5.3.1':'단사','5.3.2':'단사','5.3.3':'단사','5.3.4':'단사','5.3.5':'단사','5.3.6':'단사',
	'5.4.1':'단사','5.4.2':'단사','5.4.3':'단사','5.4.4':'단사','5.4.5':'단사','5.4.6':'단사',
	'5.5.1':'단사','5.5.2':'단사','5.5.3':'단사','5.5.4':'단사','5.5.5':'단사','5.5.6':'단사',
	'5.6.1':'단사','5.6.2':'단사','5.6.3':'단사','5.6.4':'단사','5.6.5':'단사','5.6.6':'단사',
	'5.7.1':'단사','5.7.2':'단사','5.7.3':'단사','5.7.4':'단사','5.7.5':'단사','5.7.6':'단사',
	'5.8.1':'단사','5.8.2':'단사','5.8.3':'단사','5.8.4':'단사','5.8.5':'단사','5.8.6':'단사',
	'5.9.1':'단사','5.9.2':'단사','5.9.3':'단사','5.9.4':'단사','5.9.5':'단사','5.9.6':'단사',
    '6.1.1':'初六/不永所事 小有言 終吉/불영소사 소유언 종길/',
    '6.1.2':'九二/不克訟 歸而逋 其邑人 三百戶 无眚/불극송 귀이포 기읍인 삼백호 무생/',
    '6.1.3':'六三/食舊德 貞 厲 終吉  或從王事 无成/식구덕 정 려 종길  흑종왕사 무성/', 
    '6.1.4':'九四/不克訟 復卽命 渝 安貞 吉/불극송 복즉명 유 안정 길/',
    '6.1.5':'九五/訟 元吉/송 원길/',
    '6.1.6':'上九/或錫之鞶帶 終朝三褫之/혹석지반대 종조삼치지/',
	'6.2.1':'初六/拔茅茹. 以其彙 貞 吉 亨/발모여. 이기휘 정 길 형/',
	'6.2.2':'六二/包承 小人 吉 大人 否 亨/포승 소인 길 대인 부 형/',
	'6.2.3':'六三/包 羞/포 수/',
	'6.2.4':'九四/有命 无咎 疇 離祉/유명 무구 주 리지/',
	'6.2.5':'九五/休否. 大人 吉 其亡其亡 繫于苞桑/휴부. 대인 길 기망기망 계우포상/',
	'6.2.6':'上九/傾否 先否 後喜/경부 선부 후희/',
	'6.3.1':'初九/无妄 往 吉/무망 왕 길/',
	'6.3.2':'六二/不耕 穫 不菑 畬 則利有攸往/불경 확 불치 여 즉이유유왕/',
	'6.3.3':'六三/无妄之災 或繫之牛 行人之得 邑人之災/무망지재 혹계지우 행인지득 읍인지재/',
	'6.3.4':'九四/可貞 无咎/가정 무구/',
	'6.3.5':'九五/无妄之疾 勿樂 有喜/무망지질 물락 유희/',
	'6.3.6':'上九/无妄 行 有眚 无攸利/무망 행 유생 무유리/',
	'6.4.1':'初六/繫于金柅 貞 吉 有攸往 見凶 羸豕 孚蹢躅/계우금니 정 길 유유왕 견 흉 리시 부척촉/',
	'6.4.2':'九二/包有魚 无咎 不利賓/포유어 무구 불리빈/',
	'6.4.3':'九三/臀无膚 其行 次且 厲 无大咎/둔무부 기행 차차 려 무대구/',
	'6.4.4':'九四/包无魚 起凶/포무어 기흉/',
	'6.4.5':'九五/以杞包瓜 含章 有隕自天/이기포과 함장 유운자천/',
	'6.4.6':'上九/姤其角. 吝 无咎/구기각. 인 무구/',
	'6.5.1':'단사','6.5.2':'단사','6.5.3':'단사','6.5.4':'단사','6.5.5':'단사','6.5.6':'단사',
    '6.6.1':'初九/潛龍勿用/잠용물용/',
    '6.6.2':'九二/見龍在田 利見大人/현룡재전 이견대인/',
    '6.6.3':'九三/君子 終日乾乾 夕惕若 厲 无咎/군자 종일건건 석척약 려 무구/',
    '6.6.4':'九四/或躍在淵 无咎/흑약재연 무구/',
    '6.6.5':'九五/飛龍在天 利見大人/비룡재천 이견대인/',
    '6.6.6':'上九/亢龍 有悔/항룡 유해/',
    '6.7.1':'初九/素履 往 无咎/소리 왕 무구/',
    '6.7.2':'九二/履道 坦坦 幽人 貞 吉/이도 탄탄 유인 정 길/',
    '6.7.3':'六三/眇能視 跛能履. 履虎尾 晊人  凶 武人 爲于大君/묘능시 파능리. 이호미 질인  흉 무인 위우대군/',
    '6.7.4':'九四/履虎尾 朔朔 終吉/이호미 삭삭 종길/',
    '6.7.5':'九五/夬履 貞 厲/쾌리 정 려/',
    '6.7.6':'上九/視履 考祥 其旋 元吉/시리 고상 기선 원길/',
	'6.8.1':'初六/遯尾 厲 勿用有攸往/돈미 려 물용유유왕/',
	'6.8.2':'六二/執之用黃牛之革. 莫之勝說/집지용황우지혁. 막지승설/',
	'6.8.3':'九三/係遯. 有疾 厲 慉臣妾(에는) 吉/계돈. 유질 려 휵신첩(에는) 길',
	'6.8.4':'九四/好遯 君子 吉 小人 否/호돈 군자 길 소인 부/',
	'6.8.5':'九五/嘉遯 貞 吉/가돈 정 길/',
	'6.8.6':'上九/肥遯 无不利/비돈 무불리/',
	'6.9.1':'初九/同人于門 无咎/동인우문 무구/',
	'6.9.2':'六二/同人于宗 吝/동인우종 인/',
	'6.9.3':'九三/伏戎于莽 升其高陵 三歲不興/복융우망 승기고릉 삼세불흥/',
	'6.9.4':'九四/乘其墉 弗克攻 吉/승기용 불극공 길/',
	'6.9.5':'九五/同人 先號噪以後笑 大師克 相遇/동인 선호조이후소 대사극 상우/',
	'6.9.6':'上九/同人于郊 无悔/동인우교 무회/',
	'7.1.1':'初六/臀困于株木. 入于幽谷 三歲 不覿/둔곤우주목. 입우유곡 삼세 부적/',
	'7.1.2':'九二/困于酒食 朱紱 方來 利用享祀 征 凶 无咎/곤우주식 주불 방래 이용향사 정 흉 무구/',
	'7.1.3':'六三/困于石 據于蒺藜/곤우석 거우질려/',
	'7.1.4':'九四/來徐西 困于金車 吝 有終/래서서 곤우금거 인 유종/',
	'7.1.5':'九五/劓刖 困于赤紱 乃徐有說 利用祭祀/의월 곤우적불 내서유열 이용제사/',
	'7.1.6':'上六/困于葛藟 于臲卼 曰動悔 有悔(면) 征 吉/곤우갈류 우얼올 왈동회 유회(면) 정 길/',
	'7.2.1':'初六/有孚 不終 乃亂乃萃 若號 一握爲笑 勿恤 往 无咎/유부 부종 내란내췌 약호 일악위소 물휼 왕 무구/',
	'7.2.2':'六二/引 吉 无咎 孚乃利用禴/인 길 무구 부내이용약/',
	'7.2.3':'六三/萃如嗟 无攸利 往 无咎 小吝/췌여차 무유리 왕 무구 소린/',
	'7.2.4':'九四/大吉 无咎/대길 무구/',
	'7.2.5':'九五/萃有位 无咎 匪孚 元永貞 悔 亡/췌유위 무구 비부 원영정 회 망/',
	'7.2.6':'上六/齍咨涕洟 无咎/자자체이 무구/',
	'7.3.1':'初九/官有渝 貞 吉 出門交 有功/관유유 정 길 출문교 유공/',
	'7.3.2':'六二/係小子 失丈夫/계소자 실장부/',
	'7.3.3':'六三/係丈夫 失小子 隨 有求 得 利居貞/계장부 실소자 수 유구 득 이거정/',
	'7.3.4':'九四/隨 有獲 貞 凶  有孚 在道 以明 何咎/수 유획 정 흉  유부 재도 이명 하구/',
	'7.3.5':'九五/孚于嘉 吉/부우가 길/',
	'7.3.6':'上六/拘係之 乃從維之 王用亨于西山/구계지 내종유지 왕용형우서산/',
	'7.4.1':'初六/藉用白茅 无咎/자용백모 무구/',
	'7.4.2':'九二/枯楊 生稊 老夫 得其女妻 无不利/고양 생제 노부 득기여처 무불리/',
	'7.4.3':'九三/棟 橈 凶/동 요 흉/',
	'7.4.4':'九四/棟隆 吉 有它 吝/동륭 길 유타 인/',
	'7.4.5':'九五/枯楊 生華 老婦 得其士夫 无咎 无譽/고양 생화 노부 득기사부 무구 무예/',
	'7.4.6':'上六/過涉滅頂 凶 无咎/과섭멸정 흉 무구/',
	'7.5.1':'단사','7.5.2':'단사','7.5.3':'단사','7.5.4':'단사','7.5.5':'단사','7.5.6':'단사',
	'7.6.1':'初九/壯于前趾 往 不勝 爲咎/장우전지 왕 불승 위구/',
	'7.6.2':'九二/惕號 莫夜 有戎 勿恤/척호 모야 유융 물휼/',
	'7.6.3':'九三/壯于頄 有凶 獨行遇雨 君子 夬夬 若濡有慍 无咎/장우구 유흉 독행우우 군자 쾌쾌 약유유온 무구/',
	'7.6.4':'九四/臀无膚 其行次且 牽羊 悔 亡 聞言 不信/둔무부 기행차차 견양 회 망 문언 불신/',
	'7.6.5':'九五/莧陸夬夬 中行 无咎/현률쾌쾌 중행 무구/',
	'7.6.6':'上六/无號 終有凶/무호 종유흉/',
	'7.7.1':'初九/和兌 吉/화태 길/',
	'7.7.2':'九二/孚兌 吉 悔 亡/부태 길 회 망/',
	'7.7.3':'六三/來兌 凶/래태 흉/',
	'7.7.4':'九四/商兌未寧 介疾 有喜/상태미녕 개질 유희/',
	'7.7.5':'九五/孚于剝 有厲/부우박 유려/',
	'7.7.6':'上六/引兌/인태/',
	'7.8.1':'初六/咸其拇/함기무/',
	'7.8.2':'六二/咸其腓 凶 居 吉/함기비 흉 거 길/',
	'7.8.3':'九三/咸其股. 執其隨 往 吝/함기고. 집기수 왕 인/',
	'7.8.4':'九四/貞 吉 悔 亡 憧憧往來 朋從爾思/정 길 회 망 동동왕래 붕종이사/',
	'7.8.5':'九五/咸其脢 无悔/함기매 무회/',
	'7.8.6':'上六/咸其輔頰舌/함기보협설/',
	'7.9.1':'初九/鞏用黃牛之革/공용황우지혁/',
	'7.9.2':'六二/已日 乃革之 征 吉 无咎/이일 내혁지 정 길 무구/',
	'7.9.3':'九三/征 凶 貞厲 革言 三就 有孚/정 흉 정려 혁언 삼취 유부/',
	'7.9.4':'九四/悔亡 有孚 改命 吉/회망 유부 개명 길/',
	'7.9.5':'九五/大人 虎變 未占 有孚/대인 호변 미점 유부/',
	'7.9.6':'上六/君子 豹變 小人 革面  征 凶 居貞 吉/군자 표변 소인 혁면  정 흉 거정 길/',
    '8.1.1':'初六/發蒙 利用刑人 用說桎梏  以往 吝/발몽 이용현인 용탈질곡 이왕 인/',
    '8.1.2':'九二/包蒙 吉 納婦 吉 子 克家/포몽 길 납부 길 자 극가/',
    '8.1.3':'六三/勿用取女 見金夫 不有躬 无攸利/물용취녀 견금부 불유궁 무유리/',
    '8.1.4':'六四/困蒙 吝/곤몽 인/',
    '8.1.5':'六五/童蒙 吉/동몽 길/',
    '8.1.6':'上九/擊蒙 不利爲寇 利禦寇/격몽 불리위구 이어구/',
	'8.2.1':'初六/剝牀以足 蔑貞 凶/박상이족 멸정 흉/',
	'8.2.2':'六二/剝牀以辨 蔑貞 凶/박상이변 멸정 흉/',
	'8.2.3':'六三/剝之无咎/박지무구/',
	'8.2.4':'六四/剝牀以膚 凶/박상이부 흉/',
	'8.2.5':'六五/貫魚 以宮人寵 无不利/관어 이궁인총 무불리/',
	'8.2.6':'上九/碩果不食 君子 得輿 小人 剝慮/석과불식 군자 득여 소인 박려/',
	'8.3.1':'初九/舍爾靈龜 觀我 朶頤 凶/사이영귀 관아 타이 흉/',
	'8.3.2':'六二/顚頤. 拂經 于丘 頤 征 凶/전이. 불경 우구 이 정 흉/',
	'8.3.3':'六三/拂頤貞 凶 十年勿用 无攸利/불이정 흉 십년물용 무유리/',
	'8.3.4':'六四/顚頤 吉 虎視耽耽 其欲逐逐 无咎/전이 길 호시탐탐 기욕축축 무구/',
	'8.3.5':'六五/拂經 居貞 吉 不可涉大川/불경 거정 길 불가섭대천/',
	'8.3.6':'上九/由頤 厲 吉 利涉大川/유이 려 길 이섭대천/',
	'8.4.1':'初六/幹父之蠱 有子 考 无咎  厲 終吉/간부지고 유자 고 무구  려 종길/',
	'8.4.2':'九二/幹母之蠱 不可貞/간모지고 불가정/',
	'8.4.3':'九三/幹父之蠱 小有悔 无大咎/간부지고 소유회 무대구/',
	'8.4.4':'六四/裕父之蠱 往 見吝/유부지고 왕 견린/',
	'8.4.5':'六五/幹父之蠱 用譽/간부지고 용예/',
	'8.4.6':'上九/不事王侯 高尙其事/불사왕후 고상기사/',
	'8.5.1':'단사','8.5.2':'단사','8.5.3':'단사','8.5.4':'단사','8.5.5':'단사','8.5.6':'단사',
	'8.6.1':'初九/有厲 利已/유려 이이/',
	'8.6.2':'九二/輿說輹/여탈복',
	'8.6.3':'九三/良馬逐 利艱貞 日閑輿衛 利有攸往/양마축 이간정 일한여위 이유유왕/',
	'8.6.4':'六四/童牛之牿 元吉/동우지곡 원길/',
	'8.6.5':'六五/獖豕之牙 吉/분시지아 길/',
	'8.6.6':'上九/何天之衢 亨/하천지구 형/',
	'8.7.1':'初九/已事 遄往 无咎 酌損之/이사 천왕 무구 작손지/',
	'8.7.2':'九二/利貞 征 凶 弗損 益之/이정 정 흉 불손 익지/',
	'8.7.3':'六三/三人行 則損一人 一人行 則得其友/삼인행 즉손일인 일인행 즉득기우/',
	'8.7.4':'六四/損其疾 使遄 有喜 无咎/손기질 사천 유희 무구/',
	'8.7.5':'六五/或益之 十朋之. 龜 弗克違 元吉/혹익지 십붕지. 귀 불극위 원길/',
	'8.7.6':'上九/弗損 益之 无咎 貞吉 利有攸往  得臣 无家/불손 익지 무구 정길 이유유왕  득신 무가/',
	'8.8.1':'初六/艮其趾. 无咎 利永貞/간기지. 무구 이영정/',
	'8.8.2':'六二/艮其腓 不拯其隨. 其心不快/간기비 부증기수. 기심불쾌/',
	'8.8.3':'九三/艮其限 列其夤 厲 薰心/간기한 열기인 려 훈심/',
	'8.8.4':'六四/艮其身 无咎/간기신 무구/',
	'8.8.5':'六五/艮其輔. 言有序 悔亡/간기보. 언유서 회망/',
	'8.8.6':'上九/敦艮 吉/돈간 길/',
	'8.9.1':'初九/賁 其趾 舍車而道/분 기지 사거이도/',
	'8.9.2':'六二/賁其須/분기수',
	'8.9.3':'九三/賁如 濡如 永貞 吉/분여 유여 영정 길/',
	'8.9.4':'六四/賁如 皤如 白馬 翰如 匪寇 婚媾/분여 파여 백마 한여 비구 혼구/',
	'8.9.5':'六五/賁于丘園 束帛 戔戔 吝 終吉/분우구원 속백 잔잔 인 종길/',
	'8.9.6':'上九/白賁 无咎/백분 무구/',
	'9.1.1':'初六/濡其尾 吝/유기미 인/',
	'9.1.2':'九二/曳其輪 貞 吉/예기륜 정 길/',
	'9.1.3':'六三/未濟 征 凶 利涉大川/미제 정 흉 이섭대천/',
	'9.1.4':'九四/貞 吉 悔亡  震用伐鬼方 三年 有賞于大國/정 길 회망  진용벌귀방 삼년 유상우대국/',
	'9.1.5':'六五/貞. 吉 无悔 君子之光 有孚. 吉/정. 길 무회 군자지광 유부. 길/',
	'9.1.6':'上九/有孚于飮酒 无咎 濡其首 有孚 失是/유부우음주 무구 유기수 유부 실시/',
	'9.2.1':'初六/晉如嶊如 貞 吉 罔孚 裕 无咎/진여최여 정 길 망부 유 무구/',
	'9.2.2':'六二/晉如 愁如 貞 吉 受玆介福于其王母/진여 수여 정 길 수자개복우기왕모/',
	'9.2.3':'六三/衆允 悔 望/중윤 회 망/',
	'9.2.4':'九四/晉如 鼫鼠 貞 厲/진여 석서 정 려/',
	'9.2.5':'六五/悔 亡 失得 勿恤 往 吉 无不利/회 망 실득 물휼 왕 길 무불리/',
	'9.2.6':'上九/晉其角 維用伐邑 厲 吉 无咎 貞 吝/진기각 유용벌읍 려 길 무구 정 인/',
	'9.3.1':'初九/屨校 滅趾 无咎/구교 멸지 무구/',
	'9.3.2':'六二/噬膚 滅鼻 无咎/서부 멸비 무구/',
	'9.3.3':'六三/噬腊肉 遇毒 小吝 无咎/서석육 우독 소린 무구/',
	'9.3.4':'九四/噬乾柹 得金矢 利艱貞 吉/서건시 득금시 이간정 길/',
	'9.3.5':'六五/噬乾肉 得黃金 貞厲 无咎/서건육 득황금 정려 무구/',
	'9.3.6':'上九/何校 滅耳 凶/하교 멸이 흉/',
	'9.4.1':'初六/鼎 顚趾 利出否 得妾 以其子无咎/정 전지 이출부 득첩 이기자무구/',
	'9.4.2':'九二/鼎有實 我仇 有疾 不我能卽 吉/정유실 아구 유질 불아능즉 길/',
	'9.4.3':'九三/鼎 革 其行 塞 雉膏 不食  方雨 虧悔 終吉/정 혁 기행 색 치고 불식  방우 휴회 종길/',
	'9.4.4':'九四/鼎 折足 覆公餗 其形 渥 凶/정 절족 복공속 기형 악 흉/',
	'9.4.5':'六五/鼎黃耳金鉉 利貞/정황이금현 이정/',
	'9.4.6':'上九/鼎玉鉉 大吉 无不利/정옥현 대길 무불리/',
	'9.5.1':'단사','9.5.2':'단사','9.5.3':'단사','9.5.4':'단사','9.5.5':'단사','9.5.6':'단사',
	'9.6.1':'初九/无交害 匪咎 艱則无咎/무교해 비구 간즉무구/',
	'9.6.2':'九二/大車以載 有攸往 无咎/대거이재 유유왕 무구/',
	'9.6.3':'九三/公用享于天子 小人 弗克/공용향우천자 소인 불극/',
	'9.6.4':'九四/匪其彭 无咎/비기팽 무구/',
	'9.6.5':'六五/厥孚 交如 威如 吉/궐부 교여 위여 길/',
	'9.6.6':'上九/自天祐之 吉无不利/자천우지 길무불리/',
	'9.7.1':'初九/悔 亡 喪馬 勿逐 自復 見惡人 无咎/회 망 상마 물축 자복 견악인 무구/',
	'9.7.2':'九二/遇主于巷 无咎/우주우항 무구/',
	'9.7.3':'六三/見輿曳 其牛 掣 其人 天且劓  无初 有終/견여예 기우 체 기인 천차의  무초 유종/',
	'9.7.4':'九四/睽孤 遇元夫 交孚 厲 无咎/규고 우원부 교부 려 무구/',
	'9.7.5':'六五/悔亡 厥宗 噬膚 往 何咎/회망 궐종 서부 왕 하구/',
	'9.7.6':'上九/睽孤 見豕負塗 載鬼一車 先張之弧 後說之弧 匪寇 婚媾 往遇雨 則吉/규고 견시부도 재귀일거 선장지호 후탈지호 비구 혼구 왕우우 즉길/',
	'9.8.1':'初六/旅𤨏𤨏 斯其所取災/여쇄쇄 사기소취재/',
	'9.8.2':'六二/旅卽次 懷其資 得童僕貞/여즉차 회기자 득동복정/',
	'9.8.3':'九三/旅焚其次 喪其童僕貞 厲/여분기차 상기동복정 려/',
	'9.8.4':'九四/旅于處 得其資斧 我心 不快/여우처 득기자부 아심 부쾌/',
	'9.8.5':'六五/射雉一矢亡. 終以譽命/사치일시망. 종이예명/',
	'9.8.6':'上九/鳥焚其巢 旅人 先笑後號咷. 喪牛于易 凶/조분기소 여인 선소후호도. 상우우이 흉/',
	'9.9.1':'初九/履錯然 敬之 无咎/리착연 경지 무구/',
	'9.9.2':'六二/黃離 元吉/황리 원길/',
	'9.9.3':'九三/日昃之離 不鼓缶而歌 則大耋之嗟 凶/일측지리 불고부이가 즉대질지차 흉/',
	'9.9.4':'九四/突如其來如. 焚如 死如 棄如/돌여기래여. 분여 사여 기여/',
	'9.9.5':'六五/出涕沱若 戚嗟若 吉/출체타약 척차약 길/',
	'9.9.6':'上九/王用出征 有嘉 折首 獲匪其醜 无咎/왕용출정 유가 절수 획비기추 무구/'
	};


function get_juyeok_384_hyosa(a_hyosa_key) {
	var my_val = g_juyeok_hyosa[a_hyosa_key];
	var s_split = my_val.split("/");

	return [s_split[0], s_split[1], s_split[2], s_split[3]];
}

